app/controllers/entries_controller.rb

INSERT INTO `entries` (`created_at`, `quantity`, `updated_at`, `plan_item_id`, `goal_id`, `entry_for`) VALUES('2011-04-28 11:34:09', 1, '2011-04-28 11:34:09', 2, 1, '2011-04-21')
---
  def create
    @ent = Entry.new(params[:entry])
    @goal.entries << @ent