app/controllers/goals_controller.rb

SELECT * FROM `goals` WHERE (`goals`.`id` = 1)
---
  def show
    @goal = Goal.find(params[:id])

INSERT INTO `goals` (`name`, `start_date`, `created_at`, `updated_at`, `points`, `description`, `end_date`) VALUES('Name', '2011-04-23', '2011-04-28 10:16:53', '2011-04-28 10:16:53', NULL, 'Description', '2011-05-31')
---
  def create
    @goal = Goal.new(params[:goal])
    @goal.save

SELECT * FROM `goals` WHERE (`goals`.`id` = 1)
---
  def edit
    @goal = Goal.find(params[:id])

SELECT * FROM `goals` WHERE (`goals`.`id` = 1)
UPDATE `goals` SET `updated_at` = '2011-04-29 06:45:31', `start_date` = '2011-04-29', `end_date` = '2011-05-04', `description` = '', `points` = 10 WHERE `id` = 2
---
  def update
    @goal = Goal.find(params[:id])
    @goal.update_attributes(params[:goal])