app/controllers/plan_items_controller.rb

  def create
    @plan_item = PlanItem.new(params[:plan_item])
    @goal.plan_items << @plan_item
---
INSERT INTO `goal_items` (`plan_item_id`, `goal_id`) VALUES(1, 1)
INSERT INTO `plan_items` (`name`, `created_at`, `positiveconnotation`, `updated_at`, `points`, `description`) VALUES('Plan Item', '2011-04-28 11:25:25', 1, '2011-04-28 11:25:25', '10', 'Description')

  def update
    @plan_item = @goal.plan_items.find(params[:id])
    @plan_item.update_attributes(params[:plan_item])
---
UPDATE `plan_items` SET `updated_at` = '2011-04-28 11:27:21', `positiveconnotation` = 0 WHERE `id` = 1